[
    {
        "id": "01",
        "name": "The Araby",
        "author": "James Joyce",
        "rating": 4.5,
        "image_url": "https://i.ibb.co/Kjwh24H/9274-8783871-updates.jpg",
        "details": "The short story ''Araby'' is one of fifteen stories by James Joyce published in his first book of fiction, Dubliners (1914). Each story stands on its own, but all are linked by the setting of early-20th century Dublin (Ireland), and they progress thematically from a focus on childhood innocence to age, helplessness and disillusionment. Besides its unique structure, Dubliners was also significant for the realism with which it depicted Dublin and urban life, generally. The sentimentalism of Charles Dickens' London, where young diamonds shine forth from the grime and grit, and the seedy excitement of Balzac's Paris are wholly absent from Joyce's city. Instead, the camera-like lens of his realistic style, setting the tone for early 20th-century literary Modernism, is deployed to convincingly persuade readers that this is a dreary and paralyzed town, smothered by tradition and hopelessness."
    },
    {
        "id": "02",
        "name": "Cat In The Rain",
        "rating": 4.0,
        "author": "Ernest Hemingway",
        "image_url": "https://i.ibb.co/g3TSNwr/images.jpg",
        "details": "Only two Americans are in the hotel. Their room faces the sea, a public garden, and a war monument. Many Italians come from far away to see the monument. That day, it is raining, and the American wife is looking out the window. She sees a cat under a table that is trying to keep dry. She tells her husband that she is going to get it. He tells her not to get wet. Downstairs, she is greeted by the hotel operator, whose seriousness and willingness to please she adores. When she goes outside, he sends a maid after her with an umbrella. She does not find the cat. She goes back upstairs feeling sad. She asks her husband if she should grow her hair out. He says that he likes it the way that it is. She decides that she wants a bun at the back of her neck, and a cat to stroke, and a table with her own silver, and some new clothing. He tells her to shut up and to find a book to read. She says that she still wants a cat. Just then, someone knocks at the door. It is the maid. She has brought up a cat, at the request of the hotel operator."
    },
    {
        "id": "03",
        "name": "Tell Tale Heart",
        "author": "Edgar Allan Poe",
        "rating": 4.9,
        "image_url": "https://i.ibb.co/TrpmC1p/images-1.jpg",
        "details": "An unnamed narrator opens the story by addressing the reader and claiming that he is nervous but not mad. He says that he is going to tell a story in which he will defend his sanity yet confess to having killed an old man. His motivation was neither passion nor desire for money, but rather a fear of the man pale blue eye. Again, he insists that he is not crazy because his cool and measured actions, though criminal, are not those of a madman. Every night, he went to the old man apartment and secretly observed the man sleeping. In the morning, he would behave as if everything were normal. After a week of this activity, the narrator decides, somewhat randomly, that the time is right actually to kill the old man."
    },
    {
        "id": "04",
        "name": "Ode on a Grecian Urn",
        "author": "John Keats",
        "rating": 4.1,
        "image_url": "https://i.ibb.co/mhV2Whx/1200-607361-28772934.jpg",
        "details": "Ode on a Grecian Urn examines the close relationship between art, beauty, and truth. For the speaker, it is through beauty that humankind comes closest to truth—and through art that human beings can attain this beauty (though it remains a bittersweet achievement)."
    },
    {
        "id": "05",
        "name": "Ode to the West Wind",
        "author": "Percy Bysshe Shelley",
        "rating": 4.5,
        "image_url": "https://i.ibb.co/bQwfRZV/640px-joseph-severn-posthumous-portrait-of-shelley-writing-prometheus-unbound-1845579420233505824478.jpg",
        "details": "Ode to the west wind summary explains how the poet recalls his lovely relationship with the west wind in his youth. He desires to be a dead leaf or swift cloud so the west wind would carry him thereby feelings its strength. At last, the poet appeals to the west wind to turn him into a lyre."
    },
    {
        "id": "06",
        "name": "A Valediction: Forbidding Mourning",
        "author": "John Donne",
        "rating": 4.2,
        "image_url": "https://i.ibb.co/m0HZ6DW/valediction.png",
        "details": "The poem concerns what happens when two lovers have to part, and explains the spiritual unification that makes this particular parting essentially unimportant. The speaker argues that separation should not matter to him and his lover because genuine love transcends physical distance. A valediction is a farewell."
    },
    {
        "id": "07",
        "name": "How Do I Love Thee?",
        "author": "Elizabeth Barrett Browning",
        "rating": 4.6,
        "image_url": "https://i.ibb.co/3CwPD8L/1042427074-famous-love-poems.jpg",
        "details": "In the poem, the speaker is proclaiming her unending passion for her beloved. She tells her lover just how deeply her love goes, and she also tells him how she loves him. She loves him with all of her beings, and she hopes God will grant her the ability to love him even after she has passed."
    },
    {
        "id": "08",
        "name": "Porphyria's Lover",
        "author": "Robert Browning",
        "rating": 4.5,
        "image_url": "https://i.ibb.co/VBpqmKM/porphyrias-lover-by-molly-crabapple.jpg",
        "details": "In the poem, the speaker describes being visited by his passionate lover, Porphyria. After realizing how much she cares for him, however, the speaker strangles Porphyria and then props her lifeless body up beside him. He then concludes the poem by announcing that God has yet to punish him for this murder."
    },
    {
        "id": "09",
        "name": "Few Miles above Tintern Abbey",
        "author": "William Wordsworth",
        "rating": 4.8,
        "image_url": "https://i.ibb.co/684Pd5h/1794-edward-dayes-tintern-abbey-the-river-wye.jpg",
        "details": "The full title of this poem is “Lines Composed a Few Miles above Tintern Abbey, on Revisiting the Banks of the Wye during a Tour. July 13, 1798.” It opens with the speakers declaration that five years have passed since he last visited this location, encountered its tranquil, rustic scenery, and heard the murmuring waters of the river. He recites the objects he sees again, and describes their effect upon him: the “steep and lofty cliffs” impress upon him “thoughts of more deep seclusion”; he leans against the dark sycamore tree and looks at the cottage-grounds and the orchard trees, whose fruit is still unripe. He sees the “wreaths of smoke” rising up from cottage chimneys between the trees, and imagines that they might rise from “vagrant dwellers in the houseless woods,” or from the cave of a hermit in the deep forest."
    }
]